<details ><summary>plan for staging 2025-03-30 02:43:56 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project yuki-yamamura/learn-terraform-cicd#staging has been locked by PR #5
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_role.ecr-access-2 will be created
  + resource "aws_iam_role" "ecr-access-2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecr.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecr-access-2"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ecr_access_2 will be destroyed
  # (because aws_iam_role.ecr_access_2 is not in configuration)
  - resource "aws_iam_role" "ecr_access_2" {
      - arn                   = "arn:aws:iam::544690439995:role/ecr-access-2" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecr.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-03-30T02:32:20Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ecr-access-2" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ecr-access-2" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
                # (2 unchanged attributes hidden)
            },
        ] -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAX5UQUQ45XDC7VXHMS" -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (staging)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |          RESOURCE           |
|--------|-----------------------------|
| add    | `aws_iam_role.ecr-access-2` |
| delete | `aws_iam_role.ecr_access_2` |

</details>

</details>